Tutorial/LE_Case/backGround/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
/*
    (-1.5 -2.5 -0.5)
    ( 5.5 -2.5 -0.5)
    ( 5.5  2.5 -0.5)
    (-1.5  2.5 -0.5)
    (-1.5 -2.5  0.5)
    ( 5.5 -2.5  0.5)
    ( 5.5  2.5  0.5)
    (-1.5  2.5  0.5)
*/

    (-8.0 -6.0 -0.5)
    ( 12. -6.0 -0.5)
    ( 12.  6.0 -0.5)
    (-8.0  6.0 -0.5)
    (-8.0 -6.0  0.5)
    ( 12. -6.0  0.5)
    ( 12.  6.0  0.5)
    (-8.0  6.0  0.5)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (70 50 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (200 120 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(   
/*
    overset
    {
        type overset;
        faces ();
    }
*/

    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
