Tutorial/LE_Case/backGround/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    overset
    {
       type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    wing
    {
         type           codedFixedValue;
        name		 panelDisplacement;
        value           uniform (0 0 0);
    }


    "(inlet|outlet|topAndBottom)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }


}

// ************************************************************************* //
